import GoalItem from "./GoalItem";

const Goals = () => {
  return (
    <section>
      <div className="container grid gridMushafs">
        <GoalItem delay={1} desc="توفير أداة سهلة وأقرب ما تكون من الواقع تساعد المسلم وغير المسلم على تصفح القرآن الكريم من خلال الأجهزة الإلكترونية بشكل دوري. أداة مريحة وسهلة الإستخدام وتعرض صفحات المصحف بشكلها الحقيقي" />
        <GoalItem delay={2}
          desc={`إبراز أهمية اللمحة الجمالية في العرض وتأثيرها في لفت انتباه الناظرين وشرح صدور المستخدمين مصداقا لقول رسول الله صلى الله عليه وسلم "إن الله جميل يحب الجمال" ويقاس عليه ضرورة الاهتمام بالمظهر الخارجي للمسلم لما في ذلك من تأثير إيجابي على الآخرين`}
        />
        <GoalItem delay={3} desc="توضيح أهمية العلوم الحياتية في حياة المسلمين وأنها قد تتساوى مع العلوم الشرعية في الأهمية إذا صححت النية، فهذا الموقع دعوة للتعلم والقراءة في العلوم الحياتية التي لها تأثير إيجابي ( مباشرة أو غير مباشرة ) في المجتمع ثم تطبيق هذه العلوم في الوقت المناسب" />
        <GoalItem delay={4} desc="نسأل الله كل من أعجب بهذا الموقع أن يدعو لي علي هذا العمل المبارك بالإخلاص التام والنية الصادقة مع الله تعالى وأن يتقبل الله تعالى هذا العمل ويكون الموقع سببا لمن اهتدى." />
      </div>
    </section>
  );
};

export default Goals;
